; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-39)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 ball39 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(ball ball39)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
(at ball35 room4)
(at ball36 room4)
(at ball37 room4)
(at ball38 room4)
(at ball39 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 roomb)
(at ball34 roomb)
(at ball35 roomb)
(at ball36 roomb)
(at ball37 roomb)
(at ball38 roomb)
(at ball39 roomb)
)
)
)

; plan
1. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 8 of 39
2. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 8 of 39
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 39
4. (drop ball6 roomb right)
   deleted: (carry ball6 right)
   added: (at ball6 roomb) (free right)
   goals met: 9 of 39
5. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 10 of 39
6. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 10 of 39
7. (pick ball39 room4 left)
   deleted: (at ball39 room4) (free left)
   added: (carry ball39 left)
   goals met: 10 of 39
8. (pick ball38 room4 right)
   deleted: (at ball38 room4) (free right)
   added: (carry ball38 right)
   goals met: 10 of 39
9. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 10 of 39
10. (drop ball38 roomb right)
   deleted: (carry ball38 right)
   added: (at ball38 roomb) (free right)
   goals met: 11 of 39
11. (drop ball39 roomb left)
   deleted: (carry ball39 left)
   added: (at ball39 roomb) (free left)
   goals met: 12 of 39
12. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 12 of 39
13. (pick ball37 room4 left)
   deleted: (at ball37 room4) (free left)
   added: (carry ball37 left)
   goals met: 12 of 39
14. (pick ball36 room4 right)
   deleted: (at ball36 room4) (free right)
   added: (carry ball36 right)
   goals met: 12 of 39
15. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 12 of 39
16. (drop ball36 roomb right)
   deleted: (carry ball36 right)
   added: (at ball36 roomb) (free right)
   goals met: 13 of 39
17. (drop ball37 roomb left)
   deleted: (carry ball37 left)
   added: (at ball37 roomb) (free left)
   goals met: 14 of 39
18. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 14 of 39
19. (pick ball35 room4 left)
   deleted: (at ball35 room4) (free left)
   added: (carry ball35 left)
   goals met: 14 of 39
20. (pick ball34 room4 right)
   deleted: (at ball34 room4) (free right)
   added: (carry ball34 right)
   goals met: 14 of 39
21. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 14 of 39
22. (drop ball34 roomb right)
   deleted: (carry ball34 right)
   added: (at ball34 roomb) (free right)
   goals met: 15 of 39
23. (drop ball35 roomb left)
   deleted: (carry ball35 left)
   added: (at ball35 roomb) (free left)
   goals met: 16 of 39
24. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 16 of 39
25. (pick ball33 room4 left)
   deleted: (at ball33 room4) (free left)
   added: (carry ball33 left)
   goals met: 16 of 39
26. (pick ball32 room4 right)
   deleted: (at ball32 room4) (free right)
   added: (carry ball32 right)
   goals met: 16 of 39
27. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 16 of 39
28. (drop ball32 roomb right)
   deleted: (carry ball32 right)
   added: (at ball32 roomb) (free right)
   goals met: 17 of 39
29. (drop ball33 roomb left)
   deleted: (carry ball33 left)
   added: (at ball33 roomb) (free left)
   goals met: 18 of 39
30. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 18 of 39
31. (pick ball31 room3 left)
   deleted: (at ball31 room3) (free left)
   added: (carry ball31 left)
   goals met: 18 of 39
32. (pick ball30 room3 right)
   deleted: (at ball30 room3) (free right)
   added: (carry ball30 right)
   goals met: 18 of 39
33. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 18 of 39
34. (drop ball30 roomb right)
   deleted: (carry ball30 right)
   added: (at ball30 roomb) (free right)
   goals met: 19 of 39
35. (drop ball31 roomb left)
   deleted: (carry ball31 left)
   added: (at ball31 roomb) (free left)
   goals met: 20 of 39
36. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 20 of 39
37. (pick ball29 room3 left)
   deleted: (at ball29 room3) (free left)
   added: (carry ball29 left)
   goals met: 20 of 39
38. (pick ball28 room3 right)
   deleted: (at ball28 room3) (free right)
   added: (carry ball28 right)
   goals met: 20 of 39
39. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 20 of 39
40. (drop ball28 roomb right)
   deleted: (carry ball28 right)
   added: (at ball28 roomb) (free right)
   goals met: 21 of 39
41. (drop ball29 roomb left)
   deleted: (carry ball29 left)
   added: (at ball29 roomb) (free left)
   goals met: 22 of 39
42. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 22 of 39
43. (pick ball27 room3 left)
   deleted: (at ball27 room3) (free left)
   added: (carry ball27 left)
   goals met: 22 of 39
44. (pick ball26 room3 right)
   deleted: (at ball26 room3) (free right)
   added: (carry ball26 right)
   goals met: 22 of 39
45. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 22 of 39
46. (drop ball26 roomb right)
   deleted: (carry ball26 right)
   added: (at ball26 roomb) (free right)
   goals met: 23 of 39
47. (drop ball27 roomb left)
   deleted: (carry ball27 left)
   added: (at ball27 roomb) (free left)
   goals met: 24 of 39
48. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 24 of 39
49. (pick ball25 room3 left)
   deleted: (at ball25 room3) (free left)
   added: (carry ball25 left)
   goals met: 24 of 39
50. (pick ball24 room3 right)
   deleted: (at ball24 room3) (free right)
   added: (carry ball24 right)
   goals met: 24 of 39
51. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 24 of 39
52. (drop ball24 roomb right)
   deleted: (carry ball24 right)
   added: (at ball24 roomb) (free right)
   goals met: 25 of 39
53. (drop ball25 roomb left)
   deleted: (carry ball25 left)
   added: (at ball25 roomb) (free left)
   goals met: 26 of 39
54. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 26 of 39
55. (pick ball23 room3 left)
   deleted: (at ball23 room3) (free left)
   added: (carry ball23 left)
   goals met: 26 of 39
56. (pick ball22 room3 right)
   deleted: (at ball22 room3) (free right)
   added: (carry ball22 right)
   goals met: 26 of 39
57. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 26 of 39
58. (drop ball22 roomb right)
   deleted: (carry ball22 right)
   added: (at ball22 roomb) (free right)
   goals met: 27 of 39
59. (drop ball23 roomb left)
   deleted: (carry ball23 left)
   added: (at ball23 roomb) (free left)
   goals met: 28 of 39
60. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 28 of 39
61. (pick ball21 room3 left)
   deleted: (at ball21 room3) (free left)
   added: (carry ball21 left)
   goals met: 28 of 39
62. (pick ball20 room3 right)
   deleted: (at ball20 room3) (free right)
   added: (carry ball20 right)
   goals met: 28 of 39
63. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 28 of 39
64. (drop ball20 roomb right)
   deleted: (carry ball20 right)
   added: (at ball20 roomb) (free right)
   goals met: 29 of 39
65. (drop ball21 roomb left)
   deleted: (carry ball21 left)
   added: (at ball21 roomb) (free left)
   goals met: 30 of 39
66. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 30 of 39
67. (pick ball19 room3 left)
   deleted: (at ball19 room3) (free left)
   added: (carry ball19 left)
   goals met: 30 of 39
68. (pick ball18 room3 right)
   deleted: (at ball18 room3) (free right)
   added: (carry ball18 right)
   goals met: 30 of 39
69. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 30 of 39
70. (drop ball18 roomb right)
   deleted: (carry ball18 right)
   added: (at ball18 roomb) (free right)
   goals met: 31 of 39
71. (drop ball19 roomb left)
   deleted: (carry ball19 left)
   added: (at ball19 roomb) (free left)
   goals met: 32 of 39
72. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 32 of 39
73. (pick ball17 room3 left)
   deleted: (at ball17 room3) (free left)
   added: (carry ball17 left)
   goals met: 32 of 39
74. (pick ball16 room3 right)
   deleted: (at ball16 room3) (free right)
   added: (carry ball16 right)
   goals met: 32 of 39
75. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 32 of 39
76. (drop ball16 roomb right)
   deleted: (carry ball16 right)
   added: (at ball16 roomb) (free right)
   goals met: 33 of 39
77. (drop ball17 roomb left)
   deleted: (carry ball17 left)
   added: (at ball17 roomb) (free left)
   goals met: 34 of 39
78. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 34 of 39
79. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 34 of 39
80. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 34 of 39
81. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 34 of 39
82. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at ball4 roomb) (free right)
   goals met: 35 of 39
83. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 36 of 39
84. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 36 of 39
85. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 36 of 39
86. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 36 of 39
87. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 36 of 39
88. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 37 of 39
89. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 38 of 39
90. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 38 of 39
91. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 38 of 39
92. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 38 of 39
93. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 39 of 39
